package Task_3;

/**
 * Создать классы Point и Figure. Класс Point должен содержать два
 * целочисленных поля и одно строковое поле (координаты x, y и название
 * точки ). Создать три свойства с одним методом доступа get. Создать
 * пользовательский конструктор, в теле которого проинициализируйте
 * поля значениями аргументов. Класс Figure должен содержать
 * конструкторы, которые принимают от 3-х до 5-ти аргументов типа Point.
 * Создать два метода: double LengthSide(Point A, Point B),
 * который рассчитывает длину стороны многоугольника; void
 * PerimeterCalculator(), который рассчитывает периметр
 * многоугольника. Написать программу, которая выводит на экран
 * название и периметр многоугольника. (длина стороны находится
 * следующим образом – от координат второй точки, отнимаются
 * координаты первой точки x = x2 – x1, y = y2 – y1).
 */
public class Main {
    public static void main(String[] args) {


    }
}
